

NewYork>en
Password: 
NewYork#show int se0/0/1
Serial0/0/1 is up, line protocol is up (connected)
  Hardware is HD64570
  Internet address is 192.168.0.5/30
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, loopback not set, keepalive set (10 sec)
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0 (size/max/drops); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops)
     Conversations  0/0/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 25 bits/sec, 0 packets/sec
  5 minute output rate 18 bits/sec, 0 packets/sec
     33 packets input, 2684 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     23 packets output, 1512 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 output buffer failures, 0 output buffers swapped out
     0 carrier transitions
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
NewYork#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
NewYork(config)#router eigrp 560
NewYork(config-router)#redi
NewYork(config-router)#redistribute ospf 1 metric 1544?
<1-4294967295>  
NewYork(config-router)#redistribute ospf 1 metric 1544 ?
  <0-4294967295>  EIGRP delay metric, in 10 microsecond units
NewYork(config-router)#redistribute ospf 1 metric 1544 2000 ?
  <0-255>  EIGRP reliability metric where 255 is 100% reliable
NewYork(config-router)#redistribute ospf 1 metric 1544 2000 255 ?
  <1-255>  EIGRP Effective bandwidth metric (Loading) where 255 is 100% loaded
NewYork(config-router)#redistribute ospf 1 metric 1544 2000 255 1 ?
  <1-65535>  EIGRP MTU of the path
NewYork(config-router)#redistribute ospf 1 metric 1544 2000 255 1 1500 ?
  match  Redistribution of OSPF routes
  <cr>
NewYork(config-router)#redistribute ospf 1 metric 1544 2000 255 1 1500 





NewYork(config)#router ospf 1
NewYork(config-router)#redistribute eigrp 560 metric-type 1 


